tests/xma/4.1/xma_ProvAPI/Operator-API/update-with-nameOnly.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tns="http://policy.intf.mobilgw.com/">
  <soap:Body>
    <tns:update>
      <arg0>
        <name>Operator2</name>
        <passwordHash/>
        <role/>
        <updateTimestampMillis/>
      </arg0>
    </tns:update>
  </soap:Body>
</soap:Envelope>